{
  "backend/main.mo": "Defines the core backend actor with employee, attendance, and monthly summary types plus comparison helpers and storage mixins.",
  "backend/migration.mo": "Migrates old employee records to the new schema by adding a designation field defaulting to #other.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to changed frontend files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend source files for reference or tooling use.",
  "frontend/index.css": "Defines Tailwind base styles and theme variables for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, authentication gating, profile setup enforcement, and global theming for the React app.",
  "frontend/src/components/attendance/AttendanceEntryDialog.tsx": "A dialog for recording employee attendance, handling working status, check-in/out times, and submitting data via mutation hooks.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity, handling authentication state and errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A dialog prompting new users to enter their name and save their profile using a mutation hook.",
  "frontend/src/components/employees/EmployeeFormDialog.tsx": "Form dialog for adding a new employee with fields for ID, name, designation, location, type, project, and photo.",
  "frontend/src/components/employees/EmployeePhotoThumbnail.tsx": "Displays an employee's photo or a fallback icon, loading the image from an ExternalBlob.",
  "frontend/src/components/employees/EmployeePhotoUpload.tsx": "Handles image upload with validation, preview, progress tracking, and returns an ExternalBlob.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, navigation, user greeting, authentication button, and footer.",
  "frontend/src/components/overtime/OvertimeThresholdCard.tsx": "React card component that displays and lets admins edit the daily overtime hours threshold using query hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading and managing identities via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user, employee, authorization, and attendance data via the actor.",
  "frontend/src/index.css": "Tailwind CSS base setup defining color variables and styles for light and dark themes.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, identity provider, and global styles.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing employees, attendance status, filters, and overtime threshold with admin entry controls.",
  "frontend/src/pages/EmployeeProfilePage.tsx": "Displays an employee’s profile, fetching data by ID and rendering photo, personal info, and fallback states.",
  "frontend/src/pages/EmployeesPage.tsx": "Lists employees with search and filtering, allowing admins to add new employees via a dialog.",
  "frontend/src/pages/MonthlyReportPage.tsx": "Shows monthly attendance reports with filtering and supports admin‑only CSV export.",
  "frontend/src/utils/designation.ts": "Maps designation enums to readable labels and provides a sorted list of all options.",
  "frontend/src/utils/downloadCsv.ts": "Creates and triggers a browser download for CSV content using a Blob link.",
  "frontend/src/utils/formatDate.ts": "Formats ISO dates into a day‑month‑year string with weekday abbreviation.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and removing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the attendance app’s state, features, requirements, known issues, and reporting rules for Kuwait/Saudi employee workflows."
}